CREDITCARD Requests/SALE USING LVL3 DATA Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>{{MerchantID}}</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{TransactionSecurityKey}}</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-{{Version}}">
       <merchantID>{{MerchantID}}</merchantID>
      <merchantReferenceCode>{{$timestamp}}</merchantReferenceCode>
         <invoiceHeader>
            <userPO>61971</userPO>
         </invoiceHeader>
                  <billTo>
			<firstName>John</firstName>
			<lastName>Doe</lastName>
			<street1>1295 Charleston Road</street1>
			<city>Mountain View</city>
			<state>CA</state>
			<postalCode>94043</postalCode>
			<country>US</country>
			<email>null@cybersource.com</email>
		 </billTo>
         <item id="0">
            <unitPrice>29.00</unitPrice>
            <quantity>1</quantity>
            <productCode>22L-1-602</productCode>
            <productName>Name</productName>
            <productSKU>1234</productSKU>
            <taxAmount>0.00</taxAmount>
            <unitOfMeasure>EAC</unitOfMeasure>
            <commodityCode>26101115</commodityCode>
            <invoiceNumber>200409</invoiceNumber>
         </item>
         <purchaseTotals>
            <currency>USD</currency>
            <discountAmount>0.00</discountAmount>
            <dutyAmount>0.00</dutyAmount>
            <grandTotalAmount>29.00</grandTotalAmount>
            <freightAmount>0.00</freightAmount>
         </purchaseTotals>
         <card>
			<accountNumber>4111111111111111</accountNumber>
			<expirationMonth>11</expirationMonth>
			<expirationYear>2020</expirationYear>
		</card>
		<ccAuthService run="true"></ccAuthService>
        <ccCaptureService run="true">
            <purchasingLevel>3</purchasingLevel>
         </ccCaptureService>
      </requestMessage>

  </soapenv:Body>
</soapenv:Envelope>